000_РОЗНИЦА_ЦЕНТР/src/Reports/АнализСкладскихДокументов/АнализСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализСкладскихДокументов</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВывестиТолькоПроблемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчитатьПроблемойПеремещениеБезОрдера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчитатьПроблемойПроведенНеВыгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДокументов</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

000_РОЗНИЦА_ЦЕНТР/src/Reports/АнализСкладскихДокументов/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьТаблицуВидовДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Для каждого ЭлементНастройки Из НастройкаВидовДокументов Цикл

		Если НЕ ЭлементНастройки.Пометка Тогда

			СтрокиТаблицы = Отчет.ВидыДокументов.НайтиСтроки(
				Новый Структура("ПолноеИмя", ЭлементНастройки.Значение));

			Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл

				СтрокаТаблицы.Пометка = Ложь;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	НастройкаВидовДокументов.Очистить();

	Для каждого СтрокаТаблицы Из Отчет.ВидыДокументов Цикл

		НастройкаВидовДокументов.Добавить(СтрокаТаблицы.ПолноеИмя,, СтрокаТаблицы.Пометка);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)


КонецПроцедуры
	
#КонецОбласти

&НаСервере
Процедура СформироватьОтчетНаСервере()

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)

	СформироватьОтчетНаСервере();

	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОтчет;

	ПоказатьОповещениеПользователя("Выполнено",, "Отчет по документам сформирован", БиблиотекаКартинок.Информация32);

КонецПроцедуры

&НаСервере
Процедура УстановитьТаблицуВидовДокументов()

	СписокМетаданных = Новый Массив;
	СписокМетаданных.Добавить(Метаданные.Документы.ПеремещениеТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.ОприходованиеТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.СписаниеТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.ПересортицаТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.ПересчетТоваровСамостоятельный);

	Для каждого ЭлементСписка Из СписокМетаданных Цикл

		СтрокаТаблицы = Отчет.ВидыДокументов.Добавить();
		СтрокаТаблицы.Пометка = Истина;
		СтрокаТаблицы.Имя = ЭлементСписка.Имя;
		СтрокаТаблицы.Представление = ЭлементСписка.Синоним;
		СтрокаТаблицы.ПолноеИмя = ЭлементСписка.ПолноеИмя();

	КонецЦикла;

	Отчет.ВидыДокументов.Сортировать("Представление");

КонецПроцедуры
